In [1]:
import sqlite3

In [2]:
# Connect an SQLite database
connection=sqlite3.connect('example.db')
connection

In [3]:
cursor=connection.cursor()

In [4]:
# Create a Table
cursor.execute('''
Create Table If Not Exists employees(
            id Integer Primary Key,
            name Text Not Null,
            age Integer,
            department Text
            )
''')

#commit changes
connection.commit()

In [5]:
cursor.execute('''
Select * from employees
''')

In [6]:
# Insert the data in sqlite table
cursor.execute('''
INSERT INTO employees(name,age,department)
VALUES('krish',32,'Data Scientist')
''')

cursor.execute('''
INSERT INTO employees(name,age,department)
VALUES('Bob',25,'Engineering')
''')

cursor.execute('''
INSERT INTO employees(name,age,department)
VALUES('Charlie',35,'Finance')
''')

connection.commit()

In [7]:
# Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

# print the queried data
for row in rows:
    print(row)

(1, 'krish', 32, 'Data Scientist')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')

In [8]:
# Update the date in the table
cursor.execute('''
UPDATE employees
Set age=34
where name='krish'
''')

connection.commit()

In [9]:
# Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

# print the queried data
for row in rows:
    print(row)

(1, 'krish', 34, 'Data Scientist')
(2, 'Bob', 25, 'Engineering')
(3, 'Charlie', 35, 'Finance')

In [12]:
# Delete the data from the table
cursor.execute('''
Delete from employees
               where name='Bob'
''')

connection.commit()

In [13]:
# Query the data from the table
cursor.execute('Select * from employees')
rows=cursor.fetchall()

# print the queried data
for row in rows:
    print(row)

(1, 'krish', 34, 'Data Scientist')
(3, 'Charlie', 35, 'Finance')

In [15]:
#Working with sales data 
# connect to an SQLite database
connection=sqlite3.connect('sales_data.db')
cursor=connection.cursor()

# Create a tabel for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales (
               id INTEGER PRIMARY KEY,
               date TEXT NOT NULL,
               product TEXT NOT NULL,
               sales INTEGER,
               region TEXT

)
''')

# Insert data into sales table
sales_data = [
    ('2023-01-01','product1',100,'North'),
    ('2023-01-02','product2',200,'South'),
    ('2023-01-03','product1',150,'East'),
    ('2023-01-04','product3',250,'West'),
    ('2023-01-05','product2',200,'North')
]

cursor.executemany('''
Insert Into sales(date,product,sales,region)
                   values(?,?,?,?)

''',sales_data)

connection.commit()

In [16]:
# Query data from sales table
cursor.execute('SELECT  * FROM sales')
rows=cursor.fetchall()

# Print quries from data
for row in rows:
    print(row)

(1, '2023-01-01', 'product1', 100, 'North')
(2, '2023-01-02', 'product2', 200, 'South')
(3, '2023-01-03', 'product1', 150, 'East')
(4, '2023-01-04', 'product3', 250, 'West')
(5, '2023-01-05', 'product2', 200, 'North')

In [17]:
connection.close()